# Relatório de Análise I #

## Imports ##

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

## Básico ##

In [2]:
aluguel = pd.read_csv("dados/aluguel.csv", sep=";")# Sep acts like a parser
aluguel.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

### Informações Gerais sobre a Base de Dados ###

In [3]:
aluguel.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [4]:
tipos_de_dados = pd.DataFrame(aluguel.dtypes, columns = ['Tipos de Dados'])

In [5]:
tipos_de_dados.columns.name = "Variáveis"
tipos_de_dados

Variáveis  Tipos de Dados
Tipo               object
Bairro             object
Quartos             int64
Vagas               int64
Suites              int64
Area                int64
Valor             float64
Condominio        float64
IPTU              float64

In [6]:
aluguel.shape

(32960, 9)

In [7]:
aluguel.shape[0]

32960

In [8]:
aluguel.shape[1]

9

In [9]:
print("A base de dados apresenta {} registro (imóveis) e {} variáveis".format(aluguel.shape[0], aluguel.shape[1]))

A base de dados apresenta 32960 registro (imóveis) e 9 variáveis